In [2]:
import numpy as np
import pandas as pd
import os
import sys
import datetime
from sqlalchemy import create_engine
from sqlalchemy.types import NVARCHAR,VARCHAR

### 1 读取源文件

In [22]:
data=pd.read_table('StormTide_20180709.txt')
data

           2018-07-09 08:00  2018-07-09 09:00  2018-07-09 10:00  \
N01 SURGE              0.36              0.35              0.34
    TIDE               3.43              3.58              3.73
N02 SURGE              0.36              0.35              0.34
    TIDE               3.43              3.58              3.73
N03 SURGE              0.36              0.35              0.34
    TIDE               3.43              3.58              3.73

           2018-07-09 11:00  2018-07-09 12:00  2018-07-09 13:00  \
N01 SURGE              0.33              0.33              0.32
    TIDE               3.86              3.97              4.07
N02 SURGE              0.33              0.33              0.32
    TIDE               3.86              3.97              4.07
N03 SURGE              0.33              0.33              0.32
    TIDE               3.86              3.97              4.07

           2018-07-09 14:00  2018-07-09 15:00  2018-07-09 16:00  \
N01 SURGE              0.31              0.31              0.31
    TIDE               4.16              4.25              4.31
N02 SURGE              0.31              0.31              0.31
    TIDE               4.16              4.25              4.31
N03 SURGE              0.31              0.31              0.31
    TIDE               4.16              4.25              4.31

           2018-07-09 17:00        ...         2018-07-11 23:00  \
N01 SURGE              0.32        ...                     0.56
    TIDE               4.32        ...                     3.53
N02 SURGE              0.32        ...                     0.56
    TIDE               4.32        ...                     3.53
N03 SURGE              0.32        ...                     0.56
    TIDE               4.32        ...                     3.53

           2018-07-12 00:00  2018-07-12 01:00  2018-07-12 02:00  \
N01 SURGE              0.56              0.56              0.56
    TIDE               3.51              3.49              3.48
N02 SURGE              0.56              0.56              0.56
    TIDE               3.51              3.49              3.48
N03 SURGE              0.56              0.56              0.56
    TIDE               3.51              3.49              3.48

           2018-07-12 03:00  2018-07-12 04:00  2018-07-12 05:00  \
N01 SURGE              0.57              0.57              0.57
    TIDE               3.49              3.51              3.54
N02 SURGE              0.57              0.57              0.57
    TIDE               3.49              3.51              3.54
N03 SURGE              0.57              0.57              0.57
    TIDE               3.49              3.51              3.54

           2018-07-12 06:00  2018-07-12 07:00  2018-07-12 08:00
N01 SURGE              0.57              0.57              0.57
    TIDE               3.55              3.57              3.59
N02 SURGE              0.57              0.57              0.57
    TIDE               3.55              3.57              3.59
N03 SURGE              0.57              0.57              0.57
    TIDE               3.55              3.57              3.59

[6 rows x 73 columns]

### 2获取columns

In [23]:
data.columns[:5]

Index(['2018-07-09 08:00', '2018-07-09 09:00', '2018-07-09 10:00',
       '2018-07-09 11:00', '2018-07-09 12:00'],
      dtype='object')

In [24]:
data.index

MultiIndex(levels=[['N01', 'N02', 'N03'], ['SURGE', 'TIDE']],
           labels=[[0, 0, 1, 1, 2, 2], [0, 1, 0, 1, 0, 1]])

In [25]:
data.T.head()

                   N01         N02         N03
                 SURGE  TIDE SURGE  TIDE SURGE  TIDE
2018-07-09 08:00  0.36  3.43  0.36  3.43  0.36  3.43
2018-07-09 09:00  0.35  3.58  0.35  3.58  0.35  3.58
2018-07-09 10:00  0.34  3.73  0.34  3.73  0.34  3.73
2018-07-09 11:00  0.33  3.86  0.33  3.86  0.33  3.86
2018-07-09 12:00  0.33  3.97  0.33  3.97  0.33  3.97

In [26]:
data=data.T
# data.head()

In [27]:
# data['date']=data.index
data.head()

                   N01         N02         N03
                 SURGE  TIDE SURGE  TIDE SURGE  TIDE
2018-07-09 08:00  0.36  3.43  0.36  3.43  0.36  3.43
2018-07-09 09:00  0.35  3.58  0.35  3.58  0.35  3.58
2018-07-09 10:00  0.34  3.73  0.34  3.73  0.34  3.73
2018-07-09 11:00  0.33  3.86  0.33  3.86  0.33  3.86
2018-07-09 12:00  0.33  3.97  0.33  3.97  0.33  3.97

In [28]:
data.columns

MultiIndex(levels=[['N01', 'N02', 'N03'], ['SURGE', 'TIDE']],
           labels=[[0, 0, 1, 1, 2, 2], [0, 1, 0, 1, 0, 1]])

In [34]:
data.columns.levels

FrozenList([['N01', 'N02', 'N03'], ['SURGE', 'TIDE']])

In [39]:
data.columns.levels

AttributeError: 'FrozenList' object has no attribute 'size'

In [35]:
data.columns.levels[0]

Index(['N01', 'N02', 'N03'], dtype='object')

In [36]:
data.columns.levels[0][0]

'N01'

In [37]:
for temp in data.columns.levels[0]:
    print(temp)

N01
N02
N03

In [31]:
data['N01'].head()

                  SURGE  TIDE
2018-07-09 08:00   0.36  3.43
2018-07-09 09:00   0.35  3.58
2018-07-09 10:00   0.34  3.73
2018-07-09 11:00   0.33  3.86
2018-07-09 12:00   0.33  3.97

* 找到最大值所在的位置

In [6]:
data.T.idxmax(axis=1).head()

2018-07-09 08:00    (N01, TIDE)
2018-07-09 09:00    (N01, TIDE)
2018-07-09 10:00    (N01, TIDE)
2018-07-09 11:00    (N01, TIDE)
2018-07-09 12:00    (N01, TIDE)
dtype: object

In [7]:
data.T.idxmax(axis=0).head()

N01  SURGE    2018-07-10 15:00
     TIDE     2018-07-10 01:00
N02  SURGE    2018-07-10 15:00
     TIDE     2018-07-10 01:00
N03  SURGE    2018-07-10 15:00
dtype: object

* 获取最大值出现的时间

In [8]:
pd.DataFrame([data.T.idxmax(axis=0)]).T

                          0
N01 SURGE  2018-07-10 15:00
    TIDE   2018-07-10 01:00
N02 SURGE  2018-07-10 15:00
    TIDE   2018-07-10 01:00
N03 SURGE  2018-07-10 15:00
    TIDE   2018-07-10 01:00

In [9]:
df_max_dt=data.T.idxmax(axis=0).unstack()

In [20]:
df_max_dt.columns=['Surge_DATE','Tide_DATE']

In [21]:
df_max_dt

           Surge_DATE         Tide_DATE
N01  2018-07-10 15:00  2018-07-10 01:00
N02  2018-07-10 15:00  2018-07-10 01:00
N03  2018-07-10 15:00  2018-07-10 01:00

* 获取最大值

In [12]:
data.T.max()

N01  SURGE    0.87
     TIDE     4.73
N02  SURGE    0.87
     TIDE     4.73
N03  SURGE    0.87
     TIDE     4.73
dtype: float64

In [13]:
df_max_val=data.T.max().unstack()

In [22]:
df_max_val.columns=['Surge_VALUE','Tide_VALUE']

In [23]:
df_max_val

     Surge_VALUE  Tide_VALUE
N01         0.87        4.73
N02         0.87        4.73
N03         0.87        4.73

In [24]:
final_df=pd.concat([df_max_dt,df_max_val],axis=1)

In [25]:
final_df

           Surge_DATE         Tide_DATE  Surge_VALUE  Tide_VALUE
N01  2018-07-10 15:00  2018-07-10 01:00         0.87        4.73
N02  2018-07-10 15:00  2018-07-10 01:00         0.87        4.73
N03  2018-07-10 15:00  2018-07-10 01:00         0.87        4.73

** 单独添加一列为CODE**

In [29]:
final_df['CODE']=final_df.index

In [30]:
final_df

           Surge_DATE         Tide_DATE  Surge_VALUE  Tide_VALUE CODE
N01  2018-07-10 15:00  2018-07-10 01:00         0.87        4.73  N01
N02  2018-07-10 15:00  2018-07-10 01:00         0.87        4.73  N02
N03  2018-07-10 15:00  2018-07-10 01:00         0.87        4.73  N03

追加nowdate列

In [55]:
final_df['nowdate']='2018-07-31'

* 转成csv结构化文件

In [34]:
final_df.to_csv("convert_date.csv")

### 3 修改列的类型

In [56]:
final_df['Surge_DATE']=final_df['Surge_DATE'].astype('datetime64[ns]')
final_df['Tide_DATE']=final_df['Tide_DATE'].astype('datetime64[ns]')
final_df['nowdate']=final_df['Tide_DATE'].astype('datetime64[ns]')

### 4 写入数据库

定义写入数据库的方法

In [57]:
def writeInDb(df,db_name,table_name):
        # 4、连接数据库，并写入
        # '数据库类型+数据库驱动名称://用户名:口令@机器地址:端口号/数据库名'
        # 注意若使用mysql+mysqlconnector 默认使用的是mysql-python（此模块已不再更新py3的版本）
        # connect=create_engine('mysql+mysqlconnector://admin:admin123@localhost:3306/gridforecast')
        # 单位台式机配置
        engine = create_engine('mysql+mysqldb://admin:admin123@localhost:3306/gridforecast')
        # aw配置
        # engine = create_engine('mysql+mysqldb://root:admin123@localhost:3306/gridforecast')
        dtypedict={
            'str':VARCHAR(length=4),
        }
        pd.io.sql.to_sql(df,table_name,engine,schema=db_name, if_exists='append',index=False,dtype=dtypedict)

In [58]:
db_name='gridforecast'
table_name='stormtide_stormtidedailyinfo'

In [59]:
final_df

,Surge_DATE,Tide_DATE,Surge_VALUE,Tide_VALUE,CODE,nowdate
N01,2018-07-10 15:00:00,2018-07-10 01:00:00,0.87,4.73,N01,2018-07-10 01:00:00
N02,2018-07-10 15:00:00,2018-07-10 01:00:00,0.87,4.73,N02,2018-07-10 01:00:00
N03,2018-07-10 15:00:00,2018-07-10 01:00:00,0.87,4.73,N03,2018-07-10 01:00:00

In [60]:
final_df.dtypes

Surge_DATE     datetime64[ns]
Tide_DATE      datetime64[ns]
Surge_VALUE           float64
Tide_VALUE            float64
CODE                   object
nowdate        datetime64[ns]
dtype: object

In [61]:
writeInDb(final_df,db_name,table_name)

D:\MyPogram\lib\site-packages\sqlalchemy\engine\default.py:470: Warning: (1366, "Incorrect string value: '\\xD6\\xD0\\xB9\\xFA\\xB1\\xEA...' for column 'VARIABLE_VALUE' at row 475")
  cursor.execute(statement, parameters)
D:\MyPogram\lib\site-packages\MySQLdb\cursors.py:318: Warning: (1292, "Incorrect date value: '2018-07-10 01:00:00' for column 'nowdate' at row 1")
  rows += self.execute(sql + postfix)
D:\MyPogram\lib\site-packages\MySQLdb\cursors.py:318: Warning: (1292, "Incorrect date value: '2018-07-10 01:00:00' for column 'nowdate' at row 2")
  rows += self.execute(sql + postfix)
D:\MyPogram\lib\site-packages\MySQLdb\cursors.py:318: Warning: (1292, "Incorrect date value: '2018-07-10 01:00:00' for column 'nowdate' at row 3")
  rows += self.execute(sql + postfix)

已成功